def filter_odd(numbers):
    even_numbers = [num for num in numbers if num % 2 == 0]
    print(even_numbers)

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
filter_odd(numbers)

# ფუნქცია არის Python-ის მოდულის სახელად filter_odd, რომელიც გადაეცემა ერთი არგუმენტი და ეს არის რიცხვების სია. ფუნქციის მთავარი მიზანია გამოაფილტროს მხოლოდ ლუწი რიცხვები და დააბრუნოს ახალი სია, სადაც ისეთი რიცხვები არ იქნება, რომლებიც ლუწი არაა.
# -ფუნქციის სახელ filter_odd
# - არამეტრი numbers - ეს არის რიცხვების სია, რომლის ლუწები გვინდა გაფილტრაცია.
# - რგორო უნდა გამოვიძახოთ ფუნქციას შეგვიძლია გამოვიყენოთ სხვა ფუნქციის გამოძახების შემდეგ ან პროგრამის ნაწილზე, როცა გვინდა რიცხვების ფილტრირება და შედარება ლუწი რიცხვებისგან.
