let name = prompt('enter your name')
let age = Number(prompt('enter your age'))
let runing = Number(prompt('enter your runig km გარბენა'))
let workout = Number(prompt('enter your work out day on wekek'))

// მონაცემების მიღების შემდეგ, პროგრამა უნდა შეასრულოს შემდეგი შემოწმებები:
// თუ მომხმარებლის ასაკი ნაკლებია 16-ზე ან მეტი 60-ზე, პროგრამამ უნდა დაბეჭდოს: "გთხოვთ, გაიაროთ ექიმის კონსულტაცია".
// პროგრამამ უნდა გამოიანგარიშოს ყოველკვირეული გაშვების საერთო მანძილი (კმ-ში).
// თუ ყოველკვირეული გაშვების საერთო მანძილი ნაკლებია 20 კმ-ზე, პროგრამამ უნდა დაბეჭდოს: "შესაძლებელია მეტი ვარჯიში".
if(age < 16 || age < 60) {
    console.log('გთხოვთ, გაიაროთ ექიმის კონსულტაცია');
}
let sum = runing * workout; 
    console.log(sum, 'ჯამური მანძილია');
if (sum < 20) {
    console.log("შესაძლებელია მეტი ვარჯიში");
}